#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_sql_container.relying_party_oidc_client_configs will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "relying_party_oidc_client_configs" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlDatabases/rp/containers/oidc-client-configs"
        name                  = "oidc-client-configs"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/"_etag"/?"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.key_vaults.azurerm_key_vault_certificate.lollipop_certificate_v1 will be created
  + resource "azurerm_key_vault_certificate" "lollipop_certificate_v1" {
      + certificate_attribute           = (known after apply)
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + name                            = "lollipop-certificate-v1"
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)

      + certificate_policy {
          + issuer_parameters {
              + name = "Self"
            }
          + key_properties {
              + curve      = (known after apply)
              + exportable = true
              + key_size   = 2048
              + key_type   = "RSA"
              + reuse_key  = false
            }
          + secret_properties {
              + content_type = "application/x-pem-file"
            }
          + x509_certificate_properties {
              + extended_key_usage = (known after apply)
              + key_usage          = [
                  + "cRLSign",
                  + "dataEncipherment",
                  + "digitalSignature",
                  + "keyAgreement",
                  + "keyCertSign",
                  + "keyEncipherment",
                ]
              + subject            = "CN=api.io.pagopa.it"
              + validity_in_months = 1200
            }
        }
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.op_app will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.op_app is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "op_app" {
      - account_name        = "io-p-fims-cosmos" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleAssignments/1117d593-7cf0-9cc7-083e-31086be77121" -> null
      - name                = "1117d593-7cf0-9cc7-083e-31086be77121" -> null
      - principal_id        = "8a3cd137-692a-4693-8b09-77fcc550a64d" -> null
      - resource_group_name = "io-p-fims-rg" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.op_func will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.op_func is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "op_func" {
      - account_name        = "io-p-fims-cosmos" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleAssignments/ed16d7da-c852-984e-8116-510c7e2ed338" -> null
      - name                = "ed16d7da-c852-984e-8116-510c7e2ed338" -> null
      - principal_id        = "80966237-8633-4801-9b9d-643fa7409a90" -> null
      - resource_group_name = "io-p-fims-rg" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.rp_func_sql_role will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.rp_func_sql_role is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "rp_func_sql_role" {
      - account_name        = "io-p-fims-cosmos" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleAssignments/4c9e022b-3350-372d-6a0a-1b5039dbe16f" -> null
      - name                = "4c9e022b-3350-372d-6a0a-1b5039dbe16f" -> null
      - principal_id        = "7e355345-f983-434d-b382-085068e3d888" -> null
      - resource_group_name = "io-p-fims-rg" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.user_func_sql_role will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.user_func_sql_role is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "user_func_sql_role" {
      - account_name        = "io-p-fims-cosmos" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleAssignments/a82cb163-3b50-ead0-e4e6-bc2b52bf5c9e" -> null
      - name                = "a82cb163-3b50-ead0-e4e6-bc2b52bf5c9e" -> null
      - principal_id        = "8a4570ef-c6b7-4ce2-b9f8-3b0faa6fd9a4" -> null
      - resource_group_name = "io-p-fims-rg" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos" -> null
    }

  # module.web_apps.azurerm_key_vault_access_policy.relying_party_func_key_vault_access_policy will be destroyed
  # (because azurerm_key_vault_access_policy.relying_party_func_key_vault_access_policy is not in configuration)
  - resource "azurerm_key_vault_access_policy" "relying_party_func_key_vault_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/objectId/7e355345-f983-434d-b382-085068e3d888" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> null
      - object_id               = "7e355345-f983-434d-b382-085068e3d888" -> null
      - secret_permissions      = [
          - "Get",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # module.web_apps.azurerm_key_vault_access_policy.user_func_key_vault_access_policy will be destroyed
  # (because azurerm_key_vault_access_policy.user_func_key_vault_access_policy is not in configuration)
  - resource "azurerm_key_vault_access_policy" "user_func_key_vault_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/objectId/8a4570ef-c6b7-4ce2-b9f8-3b0faa6fd9a4" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> null
      - object_id               = "8a4570ef-c6b7-4ce2-b9f8-3b0faa6fd9a4" -> null
      - secret_permissions      = [
          - "Get",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # module.web_apps.azurerm_redis_cache_access_policy_assignment.op_app will be destroyed
  # (because azurerm_redis_cache_access_policy_assignment.op_app is not in configuration)
  - resource "azurerm_redis_cache_access_policy_assignment" "op_app" {
      - access_policy_name = "Data Contributor" -> null
      - id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Cache/redis/io-p-weu-fims-redis-01/accessPolicyAssignments/op_app" -> null
      - name               = "op_app" -> null
      - object_id          = "8a3cd137-692a-4693-8b09-77fcc550a64d" -> null
      - object_id_alias    = "ServicePrincipal" -> null
      - redis_cache_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Cache/redis/io-p-weu-fims-redis-01" -> null
    }

  # module.web_apps.azurerm_role_assignment.config_queue_op_func["Storage Queue Data Message Processor"] will be destroyed
  # (because azurerm_role_assignment.config_queue_op_func is not in configuration)
  - resource "azurerm_role_assignment" "config_queue_op_func" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/63050105-58a7-c7a7-f3d1-3057e04adc2b" -> null
      - name                 = "63050105-58a7-c7a7-f3d1-3057e04adc2b" -> null
      - principal_id         = "80966237-8633-4801-9b9d-643fa7409a90" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name = "Storage Queue Data Message Processor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
    }

  # (because azurerm_role_assignment.config_queue_op_func is not in configuration)
  - resource "azurerm_role_assignment" "config_queue_op_func" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/77bdfb82-29db-e69b-3428-7b1c1a7e6dc1" -> null
      - name                 = "77bdfb82-29db-e69b-3428-7b1c1a7e6dc1" -> null
      - principal_id         = "80966237-8633-4801-9b9d-643fa7409a90" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/19e7f393-937e-4f77-808e-94535e297925" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
    }

  # module.web_apps.azurerm_role_assignment.key_vault_fims_op_app_secrets_user will be destroyed
  # (because azurerm_role_assignment.key_vault_fims_op_app_secrets_user is not in configuration)
  - resource "azurerm_role_assignment" "key_vault_fims_op_app_secrets_user" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/e69b3a50-fe16-6af6-4b90-f7a5df14abb5" -> null
      - name                 = "e69b3a50-fe16-6af6-4b90-f7a5df14abb5" -> null
      - principal_id         = "8a3cd137-692a-4693-8b09-77fcc550a64d" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> null
    }

  # module.web_apps.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> null
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value) -> null
          - "REDIS_PING_INTERVAL"                             = "540000" -> null
            # (10 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Web/sites/io-p-weu-fims-op-app-01"
        name                                           = "io-p-weu-fims-op-app-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-fims/blob/main/infra/prod/westeurope"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.op_app.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-weu-fims-op-app-snet-01"
        name                                           = "io-p-weu-fims-op-app-snet-01"
      ~ service_endpoints                              = [
          - "Microsoft.Web",
        ]
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.op_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> null
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Web/sites/io-p-weu-fims-op-func-01"
        name                                           = "io-p-weu-fims-op-func-01"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO Comunicazione"
            "Source"      = "https://github.com/pagopa/io-fims/blob/main/infra/prod/westeurope"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          ~ health_check_path                       = "/api/health" -> "/health"
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.op_func.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-weu-fims-op-func-snet-01"
        name                                           = "io-p-weu-fims-op-func-snet-01"
      ~ service_endpoints                              = [
          - "Microsoft.Web",
        ]
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.op_app_roles.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-fims-cosmos|*|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-fims-cosmos"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + resource_group_name = "io-p-fims-rg"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/"
    }

  # module.web_apps.module.op_app_roles.module.key_vault.azurerm_role_assignment.certificates["io-p-fims-rg|io-p-fims-kv|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.op_app_roles.module.key_vault.azurerm_role_assignment.keys["io-p-fims-rg|io-p-fims-kv|reader"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.op_app_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-fims-rg|io-p-fims-kv|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.op_app_roles.module.redis.azurerm_redis_cache_access_policy_assignment.this["io-p-weu-fims-redis-01|io-p-weu-fims-rg-01|writer|ServicePrincipal"] will be created
  + resource "azurerm_redis_cache_access_policy_assignment" "this" {
      + access_policy_name = "Data Contributor"
      + id                 = (known after apply)
      + name               = "8a3cd137-692a-4693-8b09-77fcc550a64d-io-p-weu-fims-redis-01|io-p-weu-fims-rg-01|writer|ServicePrincipal"
      + object_id          = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + object_id_alias    = "ServicePrincipal"
      + redis_cache_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Cache/redis/io-p-weu-fims-redis-01"
    }

  # module.web_apps.module.op_func_roles.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-fims-cosmos|*|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-fims-cosmos"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "80966237-8633-4801-9b9d-643fa7409a90"
      + resource_group_name = "io-p-fims-rg"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/"
    }

  # module.web_apps.module.op_func_roles.module.storage_account.azurerm_role_assignment.queue["iopfimsst|config-queue|reader"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "80966237-8633-4801-9b9d-643fa7409a90"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/queueServices/default/queues/config-queue"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.rp_func_roles.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-fims-cosmos|*|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-fims-cosmos"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "7e355345-f983-434d-b382-085068e3d888"
      + resource_group_name = "io-p-fims-rg"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/"
    }

  # module.web_apps.module.rp_func_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-fims-rg|io-p-fims-kv|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e355345-f983-434d-b382-085068e3d888"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.user_func_roles.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-fims-cosmos|*|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-fims-cosmos"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "8a4570ef-c6b7-4ce2-b9f8-3b0faa6fd9a4"
      + resource_group_name = "io-p-fims-rg"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-fims-cosmos/"
    }

  # module.web_apps.module.user_func_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-fims-rg|io-p-fims-kv|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a4570ef-c6b7-4ce2-b9f8-3b0faa6fd9a4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 5 to change, 10 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.cosmosdb_account_fims.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 5 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
